#language: ru

Функционал: Озон

  Сценарий: Сценарий 1 (Использовать Allure + Cucumber)
    * закрыть сообщение о cookies
    * выполнен вызов окна авторизации
    * выбрать авторизацию по e-mail
    * ввести логин-email "vladimirsiyamend@yandex.ru"
    * ввести пароль "siyamend123456789@"
    * выполнить авторизацию
    * проверить успешность авторизации
    * выполнить поиск "iphone"
    * активировать поиск
    * установить максимальное значение цены продукта "60000"
    * добавить в корзину первые "8" "нечетных" товаров
    * перейти в корзину
    * выполнить проверку добавленных товаров в корзине
    * выполнить проверку итоговой суммы
    * очистить корзину
    * выполнить выход
    * выполнен вызов окна авторизации
    * выбрать авторизацию по e-mail
    * ввести логин-email "vladimirsiyamend@yandex.ru"
    * ввести пароль "siyamend123456789@"
    * выполнить авторизацию
    * перейти в корзину
    * проверить корзину на пустоту


  Сценарий: Сценарий 2 (Использовать Allure + Cucumber)
    * закрыть сообщение о cookies
    * выполнен вызов окна авторизации
    * выбрать авторизацию по e-mail
    * ввести логин-email "vladimirsiyamend@yandex.ru"
    * ввести пароль "siyamend123456789@"
    * выполнить авторизацию
    * проверить успешность авторизации
    * выполнить поиск "беспроводные наушники"
    * активировать поиск
    * выбирать бренды
      |Samsung|
      |Beats  |
    * установить максимальное значение цены продукта "10000"
    * добавить в корзину первые "8" "четных" товаров
    * перейти в корзину
    * выполнить проверку добавленных товаров в корзине
    * выполнить проверку итоговой суммы
    * очистить корзину
    * выполнить выход
    * выполнен вызов окна авторизации
    * выбрать авторизацию по e-mail
    * ввести логин-email "vladimirsiyamend@yandex.ru"
    * ввести пароль "siyamend123456789@"
    * выполнить авторизацию
    * перейти в корзину
    * проверить корзину на пустоту
